//Hisense 機頂盒 SD-16127
//開關按鍵下面的四個白色按鍵不好用

unsigned long ir_code_s[] = {
  0xFFFFFFFF,    //empty
  0x807FC03F,    //power
  0x807FE01F,    //聲道
  0x807F807F,    //靜音
  0x807F38C7,    //1
  0x807FB847,    //2
  0x807F52AD,    //3
  0x807F32CD,    //V+
  0x807F7887,    //4
  0x807F02FD,    //5
  0x807FE21D,    //6
  0x807F926D,    //V-
  0x807F827D,    //7
  0x807F42BD,    //8
  0x807FC23D,    //9
  0x807FF807,    //P+
  0x807F12ED,    //切換
  0x807FD22D,    //0
  0x807FB04F,    //清除
  0x807F629D,    //P-
  0x807F9867,    //向左
  0x807F18E7,    //向上
  0x807F58A7,    //向右
  0x807FD827,    //向下
  0x807FF20D,    //確定
  0x807FF00F,    //選單
  0x807F6897,    //傳回
  0x807F28D7,    //離開
  0x807F708F,    //喜愛
  0x807FA25D,    //電視
  0x807F20DF,    //廣播
  0x807FA05F,    //點播
  0x807F609F,    //訊息
  0x807F00FF,    //股票
  0x807FA857,    //游戲
  0x807FE817,    //公告
  0x807F22DD,    //指南
  0x807F10EF,    //F3
  0x807F906F,    //F4
  0x807F50AF,    //F5
  0x807F30CF,    //F6
  0x807F08F7,    //F7
  0x807F8877,    //F8
  0x807FB24D,    //F9
  0x807F728D,    //F10
  0x807F48B7,    //藍色
  0x807F40BF,    //黃色
  0x807FC837,    //綠色
  0x807FD02F,    //紅色
};


