
// Decoded NEC: (32 bits)
unsigned long ir_code_r[] = {
  0xFFFFFFFF,    //empty
  0x1067C23D,    //靜音
  0x1067E21D,    //電源
  0x106742BD,    //1
  0x1067827D,    //2
  0x106702FD,    //3
  0x1067629D,    //4
  0x1067A25D,    //5
  0x106722DD,    //6
  0x106752AD,    //7
  0x1067926D,    //8
  0x106712ED,    //9
  0x1067728D,    //-/--
  0x1067B24D,    //0
  0x1067BA45,    //傳回
  0x106738C7,    //目前
  0x10675AA5,    //後續
  0x10676A95,    //清除
  0x10674AB5,    //離開
  0x10679867,    //選單
  0x106718E7,    //上頁
  0x106708F7,    //下頁
  0x1067B847,    //向左(V-)
  0x106728D7,    //向上(P+)
  0x10678877,    //向右(V-)
  0x10676897,    //向下(P-)
  0x1067A857,    //確認(中鍵)
  0x10677887,    //節目表
  0x106748B7,    //訊息
  0x10671AE5,    //紅色
  0x1067E817,    //綠色
  0x10670AF5,    //黃色
  0x1067CA35,    //藍色
  0x1067D827,    //電視
  0x1067AA55,    //喜愛
  0x1067C837,    //聲道
  0x1067DA25,    //狀態
  0x10673AC5,    //股票
  0x10672AD5,    //咨詢
  0x1067EA15,    //點播
  0x10677A85,    //EPG
  0x536F34CD,    //電源(電視)
  0x4AB0F7B6,    //電視附加碼
  0x75C15CF7,    //TV/AV(電視)
  0x6D52472D,    //+(電視)
  0xE3E10873,    //-(電視)

};



