//IR receive mapping to key
unsigned int mapping[] = {
  0,    //empty
  0,    //靜音
  0,    //電源
  49,    //1
  50,    //2
  51,    //3
  52,    //4
  53,    //5
  54,    //6
  55,    //7
  56,    //8
  57,    //9
  0,    //-/--
  48,    //0
  0,    //傳回
  145,    //目前
  143,    //後續
  8,    //清除
  140,    //離開
  141,    //選單
  142,    //上頁
  0,    //下頁
  137,    //向左(V-) 
  135,    //向上(P+)
  138,    //向右(V-)
  136,    //向下(P-)
  141,    //確認(中鍵)
  0,    //節目表
  0,    //訊息
  0,
  151,    //紅色
  152,    //綠色
  153,    //黃色
  154,    //藍色
  155,    //電視
  156,    //喜愛
  157,    //聲道
  158,    //狀態
  159,    //股票
  160,    //咨詢
  161,    //點播
  162,    //EPG
  0,    //電源(電視)
  0,    //電視附加碼
  0,    //TV/AV(電視)
  0,    //+(電視)
  0,    //-(電視)
};



